#include "7.h"
#include "struct7.h"
void Screen(Data mm[M]) {

#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	int n = M; //количество элементов в массиве
	Data inf ;
	FILE*f;
	fopen_s(&f, "t.txt", "w");

	if (f==NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		for (n = 0; n < M; n++)
		{
			printf("%d.Введите: фамилию, инициалы, год рождения, оклад>",
				n + 1);
			fscanf_s(f,"%s", mm[n].surname, sizeof(mm[n].surname));
			scanf_s( "%s", mm[n].surname, sizeof(mm[n].surname));
			fscanf_s(f,"%s", mm[n].initials, sizeof(mm[n].initials));
			scanf_s( "%s", mm[n].initials, sizeof(mm[n].initials));
			fscanf_s(f,"%hd", &mm[n].birthdate);
			scanf_s( "%hd", &mm[n].birthdate);
			fscanf_s(f,"%f", &mm[n].salary);
			scanf_s( "%f", &mm[n].salary);
		}

		cout << "Выберите операцию которую будем проводить:" << endl;
		cout << "(1)Сортировка" << endl;
		cout << "(2)Печать" << endl;
		int ans;
		int m = 0;
		cin >> ans;
		if (ans == 1)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f,"|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf( "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				
			}

			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f,"|---------------------------------------------|\n");
			fprintf(f,"|Приметка:  |---------------------------------|\n");
			fprintf(f,"|оклад уста-|---------------------------------|\n");
			fprintf(f,"|новлен на 1|---------------------------------|\n");
			fprintf(f,"|января 2000|---------------------------------|\n");
			fprintf(f,"|-----------|---------------------------------|\n");
			for (int i = 0; i < n - 1; i++) {
				m = i; /* минимальный элемент - первый */
				for (int j = i + 1; j < n; j++)

					if (strcmp(mm[m].surname, mm[j].surname) > 0) m = j;
				if (m > i) {
					inf = mm[i];
					mm[i] = mm[m];
					mm[m] = inf;
				}
			}

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
		}
		else if (ans == 2)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f,"-----------------------------------------------\n");
			fprintf(f,"|                  Отдел кадров               |\n");
			fprintf(f,"|---------------------------------------------|\n");
			fprintf(f,"|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f,"|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f,"|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf( "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
		
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
		}
		
	}

	fclose(f);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
}
void Random(Data mm[M]) {

#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	int n = M;
	Data inf;
	

	char letters[10] = { 'Л','Б','В','Ю','О','А','Д','Г','З','И'};
	for (int i = 0; i < n; i++)
	{
		mm[i].in= letters[rand() % 10];	
		mm[i].init = letters[rand() % 10];
	}

	for (int i = 0; i < n;i++) {
		mm[i].numer = i;
		mm[i].birthdate = rand() % 20 + 1956;
		mm[i].salary = rand() % 219 + static_cast <float> (rand()) / (static_cast <float> (RAND_MAX / (518)));;
	}
	for (int i = 0; i < n;i++) {
		swap(mm[rand() % n].numer, mm[rand() % n].numer);
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
}
void Sort(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	Data inf;
	FILE* f;
	fopen_s(&f, "t.txt", "w");
	int n = M;
	int m;//индекс минимального элемента
	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f,"|---------------------------------------------|\n");
		fprintf(f,"|Приметка:  |---------------------------------|\n");
		fprintf(f,"|оклад уста-|---------------------------------|\n");
		fprintf(f,"|новлен на 1|---------------------------------|\n");
		fprintf(f,"|января 2000|---------------------------------|\n");
		fprintf(f,"|-----------|---------------------------------|\n");
		for (int i = 0; i < n - 1; i++) {

			for (int j = i + 1; j < n; j++)

				if (mm[i].numer > mm[j].numer) {
					if (j > i) {
						inf = mm[i];
						mm[i] = mm[j];
						mm[j] = inf;
					}
				}
		}

		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f,"|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f);
}
void Print(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	FILE* f;
	fopen_s(&f, "t.txt", "w");
	int n = M; //количество элементов в массиве
	int i;// текущие индексы в массиве
	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f,"-----------------------------------------------\n");
		fprintf(f,"|                  Отдел кадров               |\n");
		fprintf(f,"|---------------------------------------------|\n");
		fprintf(f,"|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f,"|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f,"|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f);
}
void Screen3(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	int n = M; //количество элементов в массиве
	Data inf;
	FILE* f;
	
	fopen_s(&f, "t.txt", "a");

	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		for (n = 0; n < M; n++)
		{
			printf("%d.Введите: фамилию, инициалы, год рождения, оклад>",
				n + 1);
			fscanf_s(f, "%s", mm[n].surname, sizeof(mm[n].surname));
			scanf_s("%s", mm[n].surname, sizeof(mm[n].surname));
			fscanf_s(f, "%s", mm[n].initials, sizeof(mm[n].initials));
			scanf_s("%s", mm[n].initials, sizeof(mm[n].initials));
			fscanf_s(f, "%hd", &mm[n].birthdate);
			scanf_s("%hd", &mm[n].birthdate);
			fscanf_s(f, "%f", &mm[n].salary);
			scanf_s("%f", &mm[n].salary);
		}

		cout << "Выберите операцию которую будем проводить:" << endl;
		cout << "(1)Сортировка" << endl;
		cout << "(2)Печать" << endl;
		int ans;
		int m = 0;
		cin >> ans;
		if (ans == 1)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}

			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
			for (int i = 0; i < n - 1; i++) {
				m = i; /* минимальный элемент - первый */
				for (int j = i + 1; j < n; j++)

					if (strcmp(mm[m].surname, mm[j].surname) > 0) m = j;
				if (m > i) {
					inf = mm[i];
					mm[i] = mm[m];
					mm[m] = inf;
				}
			}

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
		}
		else if (ans == 2)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
		}
	
	}

	fclose(f);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif

}
void Print3(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	FILE* f;
	
	fopen_s(&f, "t.txt", "a");
	
	int n = M; //количество элементов в массиве
	int i;// текущие индексы в массиве
	if (f==NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		
			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f);
}
void Sort3(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	Data inf;
	FILE* f;
	
	fopen_s(&f, "t.txt", "a");
	int n = M;
	int m;//индекс минимального элемента
	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
		for (int i = 0; i < n - 1; i++) {

			for (int j = i + 1; j < n; j++)

				if (mm[i].numer > mm[j].numer) {
					if (j > i) {
						inf = mm[i];
						mm[i] = mm[j];
						mm[j] = inf;
					}
				}
		}

		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f);
}
void Screen4(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	int n = M; //количество элементов в массиве
	Data inf;
	FILE* f;
	
	fopen_s(&f, "t.txt", "r+");
	
	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		for (n = 0; n < M; n++)
		{
			printf("%d.Введите: фамилию, инициалы, год рождения, оклад>",
				n + 1);
			fscanf_s(f, "%s", mm[n].surname, sizeof(mm[n].surname));
			scanf_s("%s", mm[n].surname, sizeof(mm[n].surname));
			fscanf_s(f, "%s", mm[n].initials, sizeof(mm[n].initials));
			scanf_s("%s", mm[n].initials, sizeof(mm[n].initials));
			fscanf_s(f, "%hd", &mm[n].birthdate);
			scanf_s("%hd", &mm[n].birthdate);
			fscanf_s(f, "%f", &mm[n].salary);
			scanf_s("%f", &mm[n].salary);
		}

		cout << "Выберите операцию которую будем проводить:" << endl;
		cout << "(1)Сортировка" << endl;
		cout << "(2)Печать" << endl;
		int ans;
		int m = 0;
		cin >> ans;
		if (ans == 1)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}

			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
			for (int i = 0; i < n - 1; i++) {
				m = i; /* минимальный элемент - первый */
				for (int j = i + 1; j < n; j++)

					if (strcmp(mm[m].surname, mm[j].surname) > 0) m = j;
				if (m > i) {
					inf = mm[i];
					mm[i] = mm[m];
					mm[m] = inf;
				}
			}

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
		}
		else if (ans == 2)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f, "-----------------------------------------------\n");
			fprintf(f, "|                  Отдел кадров               |\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f, "|---------------------------------------------|\n");
			fprintf(f, "|Приметка:  |---------------------------------|\n");
			fprintf(f, "|оклад уста-|---------------------------------|\n");
			fprintf(f, "|новлен на 1|---------------------------------|\n");
			fprintf(f, "|января 2000|---------------------------------|\n");
			fprintf(f, "|-----------|---------------------------------|\n");
		}

	}

	fclose(f);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif

}
void Print4(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	FILE* f;
	
	fopen_s(&f, "t.txt", "r+");

	int n = M; //количество элементов в массиве
	int i;// текущие индексы в массиве
	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);

			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f);
}
void Sort4(Data mm[]) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	Data inf;
	FILE* f;
	fopen_s(&f, "t.txt", "r+");
	
	int n = M;
	int m;//индекс минимального элемента
	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
		for (int i = 0; i < n - 1; i++) {

			for (int j = i + 1; j < n; j++)

				if (mm[i].numer > mm[j].numer) {
					if (j > i) {
						inf = mm[i];
						mm[i] = mm[j];
						mm[j] = inf;
					}
				}
		}

		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f);
}
void Print5(Data mm[], int nomer) {
#ifdef DEBUG
	cout << "Текущая дата:" << __DATE__ << endl;
	cout << "Текущее время:" << __TIME__ << endl;
#endif
	FILE* f;
	Data inf;
	int n = M;
	char* seek = new char[M * 100];
	//бинарный файл создани
	fopen_s(&f, "t.txt", "wb");
	/*fseek(f, nomer * sizeof(int), SEEK_SET);*/
	char shelf1[500], shelf2[1000];
	int k, m;
	k = fread(shelf1, sizeof(char), 500, f);
	fclose(f);

	f = fopen("t.txt", "wb");
	m = fread(shelf2, sizeof(char), 1000, f);
	fclose(f);

	shelf1[k] = '\0';
	shelf2[m] = '\n';
	shelf2[m + 1] = '\0';

	f = fopen("t.txt", "wb");
	fwrite(strcat(shelf2, shelf1),
		sizeof(char), k + m, f);
	fclose(f);

	//for (int i = 0;i < n;i++) {
	//	fread(&seek, sizeof(Data), 1, f);
	//	/*fread(&mm[i].name, sizeof(Data), 1, f);
	//	fread(&mm[i].initials, sizeof(Data), 1, f);
	//	fread(&mm[i].init, sizeof(Data), 1, f);
	//	fread(&mm[i].birthdate, sizeof(Data), 1, f);
	//	fread(&mm[i].salary, sizeof(Data), 1, f);*/
	//}
	
	int i;// текущие индексы в массиве

	if (f == NULL) {
		puts("Ошибка при открытии файла");
		exit(0);
	}
	
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f, "-----------------------------------------------\n");
		fprintf(f, "|                  Отдел кадров               |\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f, "|---------------------------------------------|\n");
		for (int i = 0; i < n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);

			fprintf(f, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f, "|---------------------------------------------|\n");
		fprintf(f, "|Приметка:  |---------------------------------|\n");
		fprintf(f, "|оклад уста-|---------------------------------|\n");
		fprintf(f, "|новлен на 1|---------------------------------|\n");
		fprintf(f, "|января 2000|---------------------------------|\n");
		fprintf(f, "|-----------|---------------------------------|\n");
	}
	
	fclose(f);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
}
