#include "7.h"
#include "struct7.h"
void Screen(Data mm[],int count, int schet) {

#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	int n = M; 
	Data inf;
	FILE* f1;
	fopen_s(&f1, "t.txt", "w");

	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		for (int i = n * count; i < n * count + n;i++)
		{
			printf("%d.Введите: фамилию, инициалы, год рождения, оклад>",
				n + 1);
			fscanf_s(f1, "%s", mm[i].surname, sizeof(mm[i].surname));
			scanf_s("%s", mm[i].surname, sizeof(mm[i].surname));
			fscanf_s(f1, "%s", mm[i].initials, sizeof(mm[i].initials));
			scanf_s("%s", mm[i].initials, sizeof(mm[i].initials));
			fscanf_s(f1, "%hd", &mm[i].birthdate);
			scanf_s("%hd", &mm[i].birthdate);
			fscanf_s(f1, "%f", &mm[i].salary);
			scanf_s("%f", &mm[i].salary);
		}

		cout << "Действие:" << endl;
		cout << "(1)Сортировка" << endl;
		cout << "(2)Печать" << endl;
		int ans;
		int m = 0;
		cin >> ans;
		if (ans == 1)
		{
			
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n;i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}

			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
			for (int i = n * count; i < n * count + n;i++) {
				m = i; 
				for (int j = i + 1; j < n*count+n; j++)

					if (strcmp(mm[m].surname, mm[j].surname) > 0) m = j;
				if (m > i) {
					inf = mm[i];
					mm[i] = mm[m];
					mm[m] = inf;
				}
			}

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n;i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
			
		}
		else if (ans == 2)
		{
			
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n;i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
			
		}
	
	}

	fclose(f1);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
}
void Random(Data mm[], int count, int schet) {

#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	
	Data inf;


	char letters[10] = { 'А','Б','В','Д','Н','Е','И','О','С','Р' };
	for (int i = M * count; i < M * count + M;i++)
	{
		mm[i].in = letters[rand() % 10];
		mm[i].init = letters[rand() % 10];
		
	}
	for (int i = M * count; i < M * count + M;i++) {
	
		mm[i].birthdate = rand() % 20 + 1956;
		mm[i].salary = rand() % 219 + static_cast <float> (rand()) / (static_cast <float> (RAND_MAX / (518)));
		 mm[i].numer = i;
	}
	
     for (int i = M * count; i < M*count+M; i++) {
		 mm[i].numer = rand() % M ;

	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
}
void Sort(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	Data inf;
	FILE* f1;
	fopen_s(&f1, "t.txt", "w");
	int n = M;
	int m;
	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {

			for (int j = i + 1; j < n*count+n; j++)

				if (mm[i].numer > mm[j].numer) {
					if (j > i) {
						inf = mm[i];
						mm[i] = mm[j];
						mm[j] = inf;
					}
				}
		}

		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f1);
}
void Print(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	FILE* f1;
	fopen_s(&f1, "t.txt", "w");
	int n = M;
	
	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i=n*count; i < n*count+n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f1);
}
void Screen3(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	int n = M; 
	Data inf;
	FILE* f1;

	fopen_s(&f1, "t.txt", "a");

	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		for (int i = n * count; i < n * count + n; i++)
		{
			printf("%d.Введите фамилию, инициалы, год рождения, оклад>",
				n + 1);
			fscanf_s(f1, "%s", mm[i].surname, sizeof(mm[i].surname));
			scanf_s("%s", mm[i].surname, sizeof(mm[i].surname));
			fscanf_s(f1, "%s", mm[i].initials, sizeof(mm[i].initials));
			scanf_s("%s", mm[i].initials, sizeof(mm[n].initials));
			fscanf_s(f1, "%hd", &mm[i].birthdate);
			scanf_s("%hd", &mm[i].birthdate);
			fscanf_s(f1, "%f", &mm[i].salary);
			scanf_s("%f", &mm[i].salary);
		}

		cout << "Действие:" << endl;
		cout << "(1)Сортировка" << endl;
		cout << "(2)Печать" << endl;
		int ans;
		int m = 0;
		cin >> ans;
		if (ans == 1)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}

			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				m = i; 
				for (int j = i + 1; j < n*count+n; j++)

					if (strcmp(mm[m].surname, mm[j].surname) > 0) m = j;
				if (m > i) {
					inf = mm[i];
					mm[i] = mm[m];
					mm[m] = inf;
				}
			}

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
		}
		else if (ans == 2)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
		}

	}

	fclose(f1);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif

}
void Print3(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	FILE* f1;

	fopen_s(&f1, "t.txt", "a");

	int n = M; 
	int i;
	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);

			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f1);
}
void Sort3(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	Data inf;
	FILE* f1;

	fopen_s(&f1, "t.txt", "a");
	int n = M;
	int m;
	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {

			for (int j = i + 1; j < n*count+n; j++)

				if (mm[i].numer > mm[j].numer) {
					if (j > i) {
						inf = mm[i];
						mm[i] = mm[j];
						mm[j] = inf;
					}
				}
		}

		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f1);
}
void Screen4(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	int n = M; 
	Data inf;
	FILE* f1;

	fopen_s(&f1, "t.txt", "r+");

	if (f1 == NULL) {
	puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		for (int i = n * count; i < n * count + n; i++)
		{
			printf("%d.Введите фамилию, инициалы, год рождения, оклад>",
				n + 1);
			fscanf_s(f1, "%s", mm[i].surname, sizeof(mm[i].surname));
			scanf_s("%s", mm[i].surname, sizeof(mm[i].surname));
			fscanf_s(f1, "%s", mm[n].initials, sizeof(mm[i].initials));
			scanf_s("%s", mm[i].initials, sizeof(mm[i].initials));
			fscanf_s(f1, "%hd", &mm[i].birthdate);
			scanf_s("%hd", &mm[i].birthdate);
			fscanf_s(f1, "%f", &mm[i].salary);
			scanf_s("%f", &mm[i].salary);
		}

		cout << "Действие:" << endl;
		cout << "(1)Сортировка" << endl;
		cout << "(2)Печать" << endl;
		int ans;
		int m = 0;
		cin >> ans;
		if (ans == 1)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = 0; i < n; i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}

			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				m = i; 
				for (int j = i + 1; j < n*count+n; j++)

					if (strcmp(mm[m].surname, mm[j].surname) > 0) m = j;
				if (m > i) {
					inf = mm[i];
					mm[i] = mm[m];
					mm[m] = inf;
				}
			}

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
		}
		else if (ans == 2)
		{
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n; i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
		}

	}

	fclose(f1);
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif

}
void Print4(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	FILE* f1;

	fopen_s(&f1, "t.txt", "r+");

	int n = M; 
	int i;
	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);

			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f1);
}
void Sort4(Data mm[], int count, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	Data inf;
	FILE* f1;
	fopen_s(&f1, "t.txt", "r+");

	int n = M;
	int m;
	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {

			for (int j = i + 1; j < n*count+n; j++)

				if (mm[i].numer > mm[j].numer) {
					if (j > i) {
						inf = mm[i];
						mm[i] = mm[j];
						mm[j] = inf;
					}
				}
		}

		printf("-----------------------------------------------\n");
		printf("|                  Отдел кадров               |\n");
		printf("|---------------------------------------------|\n");
		printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		printf("|---------------------------------------------|\n");
		fprintf(f1, "-----------------------------------------------\n");
		fprintf(f1, "|                  Отдел кадров               |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
		fprintf(f1, "|---------------------------------------------|\n");
		for (int i = n * count; i < n * count + n; i++) {
			printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
				mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
		}
		printf("|---------------------------------------------|\n");
		printf("|Приметка:  |---------------------------------|\n");
		printf("|оклад уста-|---------------------------------|\n");
		printf("|новлен на 1|---------------------------------|\n");
		printf("|января 2000|---------------------------------|\n");
		printf("|-----------|---------------------------------|\n");
		fprintf(f1, "|---------------------------------------------|\n");
		fprintf(f1, "|Приметка:  |---------------------------------|\n");
		fprintf(f1, "|оклад уста-|---------------------------------|\n");
		fprintf(f1, "|новлен на 1|---------------------------------|\n");
		fprintf(f1, "|января 2000|---------------------------------|\n");
		fprintf(f1, "|-----------|---------------------------------|\n");
	}
#ifdef DEBUG
	cout << "\n";
	cout << "Имя файла:" << __FILE__ << endl;
	cout << "Имя функции:" << __FUNCTION__ << endl;
#endif
	fclose(f1);
}
void Print5(Data mm[], int count, bool  schetchik_name, bool schetchik_surname, int schet) {
#ifdef DEBUG
	cout << "Сегодняшняя дата:" << __DATE__ << endl;
	cout << "Сегодняшнее время:" << __TIME__ << endl;
#endif
	if (count==0) {
		cout << "Нет фамилий"<<endl;
	}
	else{
	FILE* f1;
	Data inf;
	int n = M;
	cout << "Введите, какую запись распечатаем:" << endl;
	cout << "(1)Фамилии" << endl;
	cout << "(2)Инициалы" << endl;
	cout << "(3)Год рождения" << endl;
	cout << "(4)Оклад" << endl;
	int otvet;
	cin >> otvet;
	if (otvet == 1) {
	
		fopen_s(&f1, "t.txt", "w");

		if (f1 == NULL) {
			puts("Ошибка открытия файла");
			exit(0);
		}
		else if(schetchik_name==true&& schetchik_surname == false){
			printf("|-----------------------------------------------|\n");
			printf("|                   Фамилии                     |\n");
			printf("|-----------------------------------------------|\n");
			fprintf(f1,"|-----------------------------------------------|\n");
			fprintf(f1,"|                   Фамилии                     |\n");
			fprintf(f1,"|-----------------------------------------------|\n");
			for (int i = 0; i < n*count; i++) {
				printf("|%c%-46d|\n",
					mm[i].name, mm[i].numer);
				fprintf(f1, "|%c%-46d|\n",
					mm[i].name, mm[i].numer);
			}
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
		}
		 if (schetchik_surname == true&& schetchik_name == false) {
			printf("|-----------------------------------------------|\n");
			printf("|                   Фамилии                     |\n");
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
			fprintf(f1, "|                   Фамилии                     |\n");
			fprintf(f1, "|-----------------------------------------------|\n");
			for (int i = 0; i < n * count; i++) {
				printf("|%-47s|\n",
					mm[i].surname);
				fprintf(f1, "|%46s|\n",
					mm[i].surname);
			}
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
		}
		 if (schetchik_name == true && schetchik_surname == true) {
			 printf("|-----------------------------------------------|\n");
			 printf("|                   Фамилии                     |\n");
			 printf("|-----------------------------------------------|\n");
			 fprintf(f1, "|-----------------------------------------------|\n");
			 fprintf(f1, "|                   Фамилии                     |\n");
			 fprintf(f1, "|-----------------------------------------------|\n");
			 for (int i = 0; i < n * schet ; i++) {
				 printf("|%c%-46d|\n",
					 mm[i].name, mm[i].numer);
				 fprintf(f1, "|%c%-46d|\n",
					 mm[i].name, mm[i].numer);
			 }
			 for (int i = n *schet; i < n *schet+n; i++) {
				 printf("|%-47s|\n",
					 mm[i].surname);
				 fprintf(f1, "|%46s|\n",
					 mm[i].surname);
			 }
			 printf("|-----------------------------------------------|\n");
			 fprintf(f1, "|-----------------------------------------------|\n");
			 }
		
		 fclose(f1);

		 }
	else if (otvet == 2) {
		fopen_s(&f1, "t.txt", "w");
		if (f1 == NULL) {
			puts("Ошибка открытия файла");
			exit(0);
		}
		else if (schetchik_name == true && schetchik_surname == false) {
			printf("|-----------------------------------------------|\n");
			printf("|                  Инициалы                     |\n");
			printf("|-----------------------------------------------|\n");
			fprintf(f1,"|-----------------------------------------------|\n");
			fprintf(f1,"|                  Инициалы                     |\n");
			fprintf(f1,"|-----------------------------------------------|\n");
			for (int i = 0; i < n * count; i++) {
				printf("|%c%-46d|\n",
					mm[i].in, mm[i].init);
				fprintf(f1, "|%c%-46d|\n",
					mm[i].in, mm[i].init);
			}
			printf("|-----------------------------------------------|\n");
			fprintf(f1,"|-----------------------------------------------|\n");
		}
		if (schetchik_surname == true && schetchik_name == false) {
			printf("|-----------------------------------------------|\n");
			printf("|                  Инициалы                     |\n");
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
			fprintf(f1, "|                  Инициалы                     |\n");
			fprintf(f1, "|-----------------------------------------------|\n");
			for (int i = 0; i < n * count; i++) {
				printf("|%-47s|\n",
					mm[i].initials);
				fprintf(f1, "|%46s|\n",
					mm[i].initials);
			}
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
		}
		if (schetchik_name == true && schetchik_surname == true) {
			printf("|-----------------------------------------------|\n");
			printf("|                  Инициалы                     |\n");
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
			fprintf(f1, "|                  Инициалы                     |\n");
			fprintf(f1, "|-----------------------------------------------|\n");
			for (int i = 0; i < n * schet; i++) {
				printf("|%c%-46c|\n",
					mm[i].in, mm[i].init);
				fprintf(f1, "|%c%-46c|\n",
					mm[i].in, mm[i].init);
			}
			for (int i = n * schet; i < n * schet + n; i++) {
				printf("|%-47s|\n",
					mm[i].initials);
				fprintf(f1, "|%46s|\n",
					mm[i].initials);
			}
			printf("|-----------------------------------------------|\n");
			fprintf(f1, "|-----------------------------------------------|\n");
		}
		fclose(f1);
	      }
	else if (otvet == 3) {
		  fopen_s(&f1, "t.txt", "w");

		  if (f1 == NULL) {
			  puts("Ошибка открытия файла");
			  exit(0);
		  }
		  else  {
			  printf("|-----------------------------------------------|\n");
			  printf("|                 Год рождения                  |\n");
			  printf("|-----------------------------------------------|\n");
			  fprintf(f1,"|-----------------------------------------------|\n");
			  fprintf(f1,"|                 Год рождения                  |\n");
			  fprintf(f1,"|-----------------------------------------------|\n");
			  for (int i = 0; i < n * count; i++) {
				  printf("|%-47d|\n",
					  mm[i].birthdate);
				  fprintf(f1, "|-47d|\n",
					  mm[i].birthdate);
			  }
			  printf("|-----------------------------------------------|\n");
			  fprintf(f1, "|-----------------------------------------------|\n");
		  }
		  fclose(f1);
		  }
	else if (otvet == 4) {
	fopen_s(&f1, "t.txt", "w");

	if (f1 == NULL) {
		puts("Ошибка открытия файла");
		exit(0);
	}
	else {
		printf("|-----------------------------------------------|\n");
		printf("|                    Оклад                      |\n");
		printf("|-----------------------------------------------|\n");
		fprintf(f1,"|-----------------------------------------------|\n");
		fprintf(f1,"|                    Оклад                      |\n");
		fprintf(f1,"|-----------------------------------------------|\n");
		for (int i = 0; i < n * count; i++) {
			printf("|%-47f|\n",
				mm[i].salary);
			fprintf(f1, "|-47f|\n",
				mm[i].salary);
		}
		printf("|-----------------------------------------------|\n");
		fprintf(f1, "|-----------------------------------------------|\n");
	}
	fclose(f1);
		  }
	else if (otvet>4||otvet<1) {
	cout << "Такого действия нет" << endl;
        }
     }
  }
void Print6(Data mm[], int count, bool  schetchik_name, bool schetchik_surname, int schet) {
	if (count == 0) {
		cout << "Структуры не заполнены"<<endl;
	}
	else {
		FILE* f1;
		Data inf;
		int n = M;
		fopen_s(&f1, "t.txt", "w");

		if (f1 == NULL) {
			puts("Ошибка открытия файла");
			exit(0);
		}
		else if (schetchik_name == true && schetchik_surname == false) {
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = 0; i < n * schet ; i++) {
				fscanf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
					mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
				printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
					mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
				fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
					mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");

		}


		else if (schetchik_surname == true && schetchik_name == false) {

			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count + n;i++) {
				fscanf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);

			}
			printf("|---------------------------------------------|\n");
			printf("|Приметка:  |---------------------------------|\n");
			printf("|оклад уста-|---------------------------------|\n");
			printf("|новлен на 1|---------------------------------|\n");
			printf("|января 2000|---------------------------------|\n");
			printf("|-----------|---------------------------------|\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|Приметка:  |---------------------------------|\n");
			fprintf(f1, "|оклад уста-|---------------------------------|\n");
			fprintf(f1, "|новлен на 1|---------------------------------|\n");
			fprintf(f1, "|января 2000|---------------------------------|\n");
			fprintf(f1, "|-----------|---------------------------------|\n");
		}
	
		else if (schetchik_name == true && schetchik_surname == true) {
			printf("-----------------------------------------------\n");
			printf("|                  Отдел кадров               |\n");
			printf("|---------------------------------------------|\n");
			printf("|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			printf("|---------------------------------------------|\n");
			fprintf(f1, "-----------------------------------------------\n");
			fprintf(f1, "|                  Отдел кадров               |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			fprintf(f1, "|  Фамилия  | Инициалы | Год рождения | Оклад |\n");
			fprintf(f1, "|---------------------------------------------|\n");
			for (int i = n * count; i < n * count ;i++) {
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				fprintf(f1, "|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
				printf("|%-11s|%-10s|%-14hd|%-7.2f|\n",
					mm[i].surname, mm[i].initials, mm[i].birthdate, mm[i].salary);
			}
			for (int i = n * count; i < n * count + n; i++) {
				fscanf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
					mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
				printf("|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
					mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
				fprintf(f1, "|%c%-10d|%c%-9c|%-14hd|%-7.2f|\n",
					mm[i].name, mm[i].numer, mm[i].in, mm[i].init, mm[i].birthdate, mm[i].salary);
			}
					printf("|---------------------------------------------|\n");
					printf("|Приметка:  |---------------------------------|\n");
					printf("|оклад уста-|---------------------------------|\n");
					printf("|новлен на 1|---------------------------------|\n");
					printf("|января 2000|---------------------------------|\n");
					printf("|-----------|---------------------------------|\n");
					fprintf(f1, "|---------------------------------------------|\n");
					fprintf(f1, "|Приметка:  |---------------------------------|\n");
					fprintf(f1, "|оклад уста-|---------------------------------|\n");
					fprintf(f1, "|новлен на 1|---------------------------------|\n");
					fprintf(f1, "|января 2000|---------------------------------|\n");
					fprintf(f1, "|-----------|---------------------------------|\n");
				}
				fclose(f1);
		}
 }
